import re
from collections import namedtuple
from typing import Pattern

# ============== VISUAL CONSTANTS ==============

ClickbaitInfo = namedtuple("ClickbaitInfo", ["name", "desсription", "emoji"])
CLICKBAITS: dict[str, ClickbaitInfo] = {
    True: ClickbaitInfo(
        "Клікбейт",
        "Матеріали з емоційними заголовками або сенсаційним поданням, що стимулюють кліки. Часто використовують перебільшення або інтригу без глибокого змісту.",
        "🧲"
    ),
    False: ClickbaitInfo(
        "Не клікбейт",
        "Інформативний і збалансований контент без навмисного перебільшення. Заголовки відповідають змісту, без маніпуляцій увагою.",
        "📘"
    ),
}

# ============== FINE CONSTANTS ==============

KNOWN_ABBREVIATIONS: set[str] = {
    'ЧДТРК', 'ДЛГК', 'РВІО', 'ЕНЕРГО', 'КДНП', 'РОСІЙСЬКОЮ', 'КИТАЙ', 'СТЕМ', 'СЗРУ', 'ВГСМ', 'ЛБГТ', 'РАДА', 'ФАВБЕТ',
    'ІРЦ', 'СПАРК', 'ЮНЕСКО', 'РФСР', 'КБАЛ', 'КМДА', 'ГЛОСАВ', 'ОМКФ', 'СССР', 'КВІР', 'КМОАС', 'ЄДКІ', 'ГЕРЦ', 'КЛАС',
    'ФОРТ', 'УМЗС', 'СПФП', 'ММСП', 'РСПП', 'МТЛБ', 'ГУСБУ', 'САНЖІЙКА', 'УКСНАБ', 'ЧАКІР', 'КРОВ', 'ІСАР', 'ХАМАС',
    'АФНУ', 'УКАБ', 'ФІФА', 'НІСЕПД', 'ПЗРК', 'СІЗО', 'ММКІ', 'ТЕФІ', 'ІРАКУ', 'ЗФПО', 'НАЖИВО', 'НАТО', 'УЄФА', 'СПБУ',
    'ВВЕР', 'СДЭК', 'СВІТ', 'ВЕХА', 'РСФСР', 'ФОРЭС', 'СІРА', 'ПСМА', 'МАКО', 'ОСЗН', 'ОБСЄ', 'ДЗЗСЄ', 'ХАЕС', 'ПАКС',
    'КСІР', 'БУЛІЙ', 'ДЕСС', 'ЦКАН', 'АВЕК', 'ЄАЕС', 'НАКО', 'ОБМП', 'КДМА', 'ГУФСИН', 'УКРОБОРОНПРОМ', 'БИОТЭК', 'ШІЗО',
    'ДСНС', 'ТГРС', 'СТАСІК', 'ПСРМ', 'КИНО', 'РІСУ', 'СБУС', 'АБОБА', 'ПУАЕС', 'КПВВ', 'РОВД', 'ДІСТРІБ', 'ЄБРР', 'ОШБР',
    'ГУНП', 'АГРО', 'ЄРДР', 'КОВА', 'ДЗНД', 'ІНГЗК', 'СРСР', 'РСМД', 'ІКАО', 'СЗТФ', 'КОАС', 'ТІКАНА', 'ДУДЛА', 'ГАЛА',
    'ЗУНР', 'ТАСКОМБАНК', 'ФСВН', 'ХОЛОН', 'ДНДЕКЦ', 'ЦДАКР', 'КЛУБ', 'КИЇВ', 'ВБРР', 'КВЕД', 'ІВТ', 'ЛҐБТКІА', 'МСТА',
    'РБНО', 'ТССС', 'РАЕС', 'НАМН', 'ОВДП', 'ФОТОРЕПОРТАЖ', 'БПЛА', 'ЄДЕССБ', 'ЛУКОЙЛ', 'НАСА', 'ПРАВ', 'АРЕЙ', 'ДРСМД',
    'РУСАЛ', 'ПРИВАТБАНК', 'ММПЛУ', 'ВІКИ', 'БЛІЛ', 'ДВТПРОВТ', 'ІАТА', 'ДГЛК', 'ЧАЕС', 'УФСБ', 'ДРФО', 'ЦСКА', 'РУСГИДРО',
    'МПІЛ', 'УФСІН', 'ДРШГ', 'ЛДНР', 'УДАР', 'НКВС', 'АКХЗ', 'НІПТ', 'ВОЛЗ', 'ГРДР', 'РЕПОРТАЖ', 'ГРВІ', 'ЛГБТІК', 'МОРЕНА',
    'ОАСК', 'КОМО', 'УІНП', 'СІНІАТ', 'ДДПУ', 'ОСКАР', 'ДНІПРОАЗОТ', 'УКГЦ', 'ННІЖ', 'КНІСЕ', 'ТВЕН', 'КРЫМ', 'САТІ', 'МДМА',
    'МБРР', 'ВККС', 'СОБР', 'НСЖУ', 'ОЕМК', 'КУАПП', 'ЗЕОНБУД', 'ЮНФПА', 'ЧАСТИНІ','МАСМА', 'ЮЖНИЙГІПРОГАЗ', 'СХІД', 'ЄДРПОУ',
    'ВЦРТІ', 'СВЕК', 'БАРС', 'ЛКСП', 'ДАХК', 'ДЕРНЕК', 'КДКП', 'МСУЯ', 'ГУАМ', 'АМРА', 'ПТАБ', 'УПОА', 'ЕКМО', 'ПАРЄ', 'НАСВ',
    'ШТТЛ', 'КОНКАКАФ', 'ЮМОР', 'РАДАБАНК', 'ДПЗКУ', 'ССВЯП', 'ХОЯТ', 'ІПСО', 'ОДКБ', 'МСЕК', 'АВІА', 'ДВРЗ', 'ОРЛО', 'ВУФКУ',
    'ММДС', 'МВТН', 'БРРЄ', 'МВВС', 'ЛГБТКІ', 'НСДАП', 'ХФТІ', 'ЛІСУ', 'ЄСЗС', 'ЄІБ', 'НЗНП', 'ЛИСТ', 'АІКОМ', 'СПЕЦРЕПОРТАЖ',
    'ДСЯОУ', 'ІНТБ', 'УКМВА', 'РАГС', 'АНФУ', 'УМВШ', 'ГКЧП', 'ВЕСТ', 'ХІІІ', 'ПТУР', 'БРІК', 'ОМБР', 'ДРАЦС', 'ВСМПО', 'УКРОП',
    'УКРЗАЛІЗНИЦІ', 'УКРГАЗБАНК', 'ЛАДА', 'МЗКТ', 'ЄКМТ', 'СПАУ', 'РНБО', 'НТУУ', 'НИИРС', 'ВДТРК', 'МІПЛ', 'ПТСР', 'ТУЧА',
    'МПІУ', 'ГТЛК', 'ДСНО', 'ЯНМІ', 'ТЕРГО', 'МКЧХ', 'ФСВП', 'ОПОРИ', 'ДОПОВНЕННЯ', 'КАМАЗ', 'РСЗВ', 'ДОСААФ', 'ЄСПЛ', 'СКПД',
    'ДПСУ', 'БРІКС', 'КТВР', 'РАПІД', 'УНРА', 'ТАНЕКО', 'СЄПЕК', 'ПІВНГЗК', 'ЛІГА', 'УВКБ', 'ЛОВА', 'ДЮСШ', 'НСВТ', 'ЦТАК',
    'РХБЗ', 'ЄВРО', 'УНАН', 'ДФТГ', 'ВВНЗ', 'ГРПП', 'ОПОРІ', 'КПРС', 'БЕЛТА', 'МКІП', 'БРСМ', 'ХХІІІ', 'ОСУВ', 'УКГП', 'СЕТАМ',
    'ЄВРАЗ', 'ДЕКОР', 'БГНЕС', 'ОНОВЛЕННЯ', 'ГУЛАГ', 'НАДС', 'ХДНП', 'ГДІП', 'ЕСОЗ', 'НАДУ', 'ТАНАП', 'АРСР', 'УРСС', 'ОТУВ',
    'ПТКР', 'СВПД', 'АРКА', 'ЮКОМ', 'УРСР', 'ДРГП', 'МОЗУ', 'ГУРНП', 'МОАВ', 'СІРІЗА', 'НКЦПФР', 'МОНУ', 'УКРАВТОДОРУ', 'ІНДБУД',
    'ММВБ', 'ЛАСК', 'ОЕСР', 'УЛЬФ', 'ДРУП', 'КАСТА', 'РНБОУ', 'ПОРІГ', 'ЕВМЕТСАТ', 'ДІЯР', 'АКМС', 'ТВЕЛ', 'ПТРК', 'ВООЗ', 'ЕЛЕКТІ',
    'РІОЛА', 'ПДФО', 'КМІС', 'ПДМШ', 'МЛРС', 'СОТА', 'СДПУ', 'НАЕК', 'ІСОМ', 'ОПЕК', 'АРМА', 'АВБТ', 'АНКАРОЮ', 'ЛИБІДЬ', 'НТГЕІ',
    'РБМК', 'СНПК', 'ТУТА', 'ОТРК', 'РТЦКСП', 'ВОЛЯ', 'ПОРТ', 'РНКБ', 'РВВС', 'ОМОНУ', 'ГПДП', 'УСАП', 'ПТКС', 'ОГТСУ', 'ЧОМУ',
    'ОГХК', 'ВІДЕО', 'ЗІДО', 'МЫВМЕСТЕ', 'МДЮА', 'ХОВА', 'БСРР', 'ФСТЕК', 'ОЗХЗ', 'НЕФКО', 'НДІСВ', 'ОЗОН', 'ЕАПЦ', 'ГУВС', 'ОЗХО',
    'ТНМК', 'АЗОВ', 'УЦОЯО', 'ПУМБ', 'ГУМВС', 'ВАПЛІТЕ', 'ЗГРК', 'РКБТ', 'БРПЧ', 'СПЕЦПРОЕКТУ', 'РУВС', 'АЛЕФ', 'АСЕАН', 'ЄКТС',
    'СПЕЦПРОЕКТ', 'КНДР', 'БДСМ', 'МРІЯ', 'ХАДО', 'ОДПІ', 'АСІНО', 'НТОН', 'ДКНБ', 'СОРМ', 'ОТЦК', 'ДПРЧ', 'АСКРО', 'ДТРК', 'НССС',
    'МАЯК', 'МАКС', 'ТЕКУ', 'НАЗЯВО', 'ІМЕНА', 'КОРД', 'УГКЦ', 'ЛИПНЯ', 'РИАМО', 'АССА', 'УКГС', 'НВМК', 'РСХБ', 'АТЕС', 'ДНСН',
    'НДСЛ', 'РІПЦ', 'ПТНХ', 'ЗАЕС', 'ОФАБ', 'СУСПІЛЬНЕ', 'НКРЕКП', 'ЄНАМІН', 'КРАЇН', 'ДАБІ', 'УСБУ', 'ДКВС', 'СДЕК', 'КПРФ',
    'НАМУ', 'АССУ', 'АГЗС', 'ЗРГК', 'РФПІ', 'ДВНЗ', 'КМКС', 'САРРІ', 'ЗОВА', 'ЛВДС', 'КМКЛ', 'ПМЕФ', 'АРКОС', 'РЕДУТ', 'ПРООН',
    'КРАІЛ', 'ЮКОС', 'УМПБ', 'ОЛАБІН', 'ЛДПМ', 'ВККСУ', 'КОДА', 'ЦСКІБ', 'ЛГБТ', 'ТААС', 'ХБРЯ', 'СОЦІС', 'РВПК', 'ГУЛАГУ', 'ФІДЕ',
    'ЮНІСЕФ', 'ХДМА', 'НСТУ', 'ІНГО', 'ТАРС', 'КЗРК', 'ПАЧЕС', 'КШППВ', 'ЦИАМ', 'БДІЛП', 'ОСББ', 'НТСУ', 'ІСАО', 'БЗВП', 'ЦАХАЛ',
    'МІСТО', 'КФОР', 'ІДІЛ', 'АКТУМ', 'ІЄСП', 'ФМДУ', 'УНСО', 'ДЕІФ', 'СИБУР', 'АРМУ', 'РФЯЦ', 'ВІКА', 'РСОО', 'УМПК', 'РСЗО',
    'ПРРО', 'РКРТ', 'НАЗК', 'ЗЗБК', 'РСФРР', 'УТОС', 'УПІК', 'БУДУ', 'РАЦС', 'ЗМІН', 'СНІД', 'ГУВБ', 'БАГАЦ', 'НХМУ', 'ПАЕД',
    'КМВА', 'НТКУ', 'ПРСМ', 'РУСАДА', 'ЯНАО', 'ВЕБТ', 'ФАРК', 'КДКА', 'НАПН', 'ГЛОБАЛ', 'ЄФВВ', 'ОПЗЖ', 'ИРКУТ', 'АГАТ', 'ОВНС',
    'АМПУ', 'НАУКМА', 'ПАЕС', 'РУСИЧ', 'УМВС', 'ДРЛО', 'ГАЕС', 'ГЛОНАСС', 'АМІК', 'АСОП', 'ВКМС', 'АКСУ', 'ОМОН', 'ВАКС', 'ДСГП',
    'ОГТС', 'БАФТА', 'ФІБА', 'ЯНОС', 'ЛГТБ', 'ГРАУ', 'ОМСП', 'РААМ', 'БТЛБ', 'ВДНГ', 'СМЕРШ', 'ЗУРАБА', 'ОРДЛО', 'БДІПЛ', 'КРМБ',
    'РНОКПП', 'БКМО', 'ДАРТ', 'УАППО', 'ТЗНК', 'АТЕШ', 'МОСТ', 'НАНЦ', 'КОРДУ', 'УСША', 'НГВУ', 'СКАЙ', 'НАЙС', 'АТОР', 'ДАСУ',
    'ГТРК', 'МФЧХ', 'ЗЕРО', 'ОХМАТДИТ', 'ФДМУ', 'БУГАЗ', 'ВОЛЛ', 'НФВТ', 'УТОГ', 'ФАСП', 'СЦКК', 'ВГТРК', 'ЄДБО', 'ДРЕС', 'ЦНАП',
    'УЕФА', 'НКРЗІ', 'ДБСТ', 'РОЛІ', 'ЮЖНІІГІПРОГАЗ', 'ГЛАС', 'ТАСС', 'МБАК', 'ДТЕУ', 'ХІСД', 'ІЕПОР', 'ЦОТІЗ', 'ОМСТ', 'ФЛАУ',
    'АМКУ', 'МАУП', 'КЮРМ', 'ЛДПР', 'САПО', 'УДАРУ', 'ФАТХ', 'ДОКС', 'БРЕЛ', 'ФОТО', 'МПРС', 'ЄДІСТ', 'КППВ', 'ПНРМЗ', 'УВКПЛ',
    'УСРР', 'РТЦК', 'ОТКР', 'БАТЕ', 'ДТЕК', 'УММА', 'НАПКА', 'ЦЕРН', 'НСЗУ', 'МЕРТ', 'ГАСК', 'ГІОЦ', 'НЕСТ', 'ОГШБ', 'НМІУ', 'БРДМ',
    'ПЛЮСПЛЮС', 'ЕКОСОР', 'ЦКПХ', 'ОФАК', 'НКАО', 'СИЗО', 'НАОНІ', 'ІСРО', 'АКАТА', 'НСПК', 'СБУШ', 'ПЛЕСО', 'УДСНС', 'ТЕХНА',
    'ҐРУНТ', 'ЛИШЕ', 'ДМСУ', 'ОГПУ', 'ЛГБТК', 'УТЕС', 'ЄДЕБО', 'НАБУ', 'ЛГБТКІА', 'ВМСУ', 'СІПАП', 'НКРЕ', 'ХНУПС', 'ІКЕА','РПСЦ',
    'КВБЗ', 'МАСЦО', 'ПКФО', 'ОККО', 'ДВОКУ', 'ОРДО', 'ЛОДА', 'ЕППЛ', 'КАЕС', 'ФГУП', 'УАПЦ', 'ФСИН'
}

EMOTIONAL_EMOJIS: set[str] = {
    "😱", "🤯", "😤", "😵", "👀", "😨", "😵‍💫", "🫨", "🤢", "🤮", "😖",  
    "🫣", "🤨", "😠", "🫠", "👹", "👺", "⚡", "🛑", "⛔", "‼️", "❗",
    "🚫", "🤕", "🥶", "😬", "🙀", "🫢", "👎", "👊", "✊", "😒", "🙄",
    "😑", "😞", "🥴", "💥", "⚠️", "🔞", "🔴", "🔺", "🔻", "📉", "📛",
    "💢", "🗯️", "🆖", "🚷", "😟", "💀", "☠️", "🩸", "🚔", "💨", "👻",
    "🫤", "🫡", "😔", "💰", "🤑", "🪦", "🏴‍☠️", "🔫", "🎭", "👿", "😾",
    "😷", "💔", "💣", "🚨", "‼", "☠", "😁", "😆", "🕯", "🥹", "⭐", "💙",
    "🧨", "😡", "❓", "❄", "💲", "😭", "😢", "🤬", "🥺", "✈", "😍", "😂", 
    "🤔", "💫", "🥵", "😳", "💛", "😮", "❌", "😈", "⭕", "🦠", "☢", "🚀",
    "🔥", "❕", "❤", "🤡", "🟡", "🧡", "🆓", "🔜", "🆘", "🔝","🆙", "👽",
    "😧","😰", "😲", "⚛️", "⚛", "🍌", "📊", "☣️", "☣", "🫦", "🦴"    
}

EMOJIS_REGEX: Pattern[str] = re.compile("["
        u"\U0001F600-\U0001F64F"  # emoticons
        u"\U0001F300-\U0001F5FF"  # symbols & pictographs
        u"\U0001F680-\U0001F6FF"  # transport & map symbols
        u"\U0001F1E0-\U0001F1FF"  # flags (iOS)
        u"\U00002500-\U00002BEF"  # chinese char
        u"\U00002702-\U000027B0"
        u"\U000024C2-\U0001F251"
        u"\U0001f926-\U0001f937"
        u"\U00010000-\U0010ffff"
        u"\u2640-\u2642" 
        u"\u2600-\u2B55"
        u"\u200d"
        u"\u23cf"
        u"\u23e9"
        u"\u231a"
        u"\ufe0f"  # dingbats
        u"\u3030"
        "‼"
    "]+", re.UNICODE)