import re

SOCIALS = ['сторінки', 'канали', 'telegram', 'телеграм', 'viber', 'вайбер', 'instagram', 'інстаграм', 'facebook', 'фейсбук', 'twitter', 'твіттер', 'твітер', 'youtube', 'ютуб', 'google news']
SOCIALS_STRING = '|'.join(SOCIALS)

ADS_REGEXEN = [
    fr'(?:(?:підпи(суй|шіть|ши)|приєд(нуй|най)|читай)(?:те)?с?[ья]?)\s*(новини)?\s*([«"]?\s*[^\.!,?:]*\s*[»"]?)?\s*(?:на(с|шому)\s*)?(?:у|в|до|на)\s*(?:на(?:ш|с|шого|ших|ші|шому)?\s*({SOCIALS_STRING}))?',
    fr'(слідкуйте за нашою сторінкою)|(в нас)\s(у|в|на)\s*({SOCIALS_STRING})',
    fr'^(дізнавай(те)?с[ья])|(читай(те)?)\s*.+(на|у|в)/+({SOCIALS_STRING})і?',
    fr'(ми у соцiальних мережах)|(наші соцмережі)|(наш ({SOCIALS_STRING})\b)',
    r'^((ми [уво] (соц)?мережах)|(cлідкуйте за нами у соцмережах)|(слідкуйте за останніми новинами)|(долучайтеся, читайте та дивіться новини)|(усі найцікавіші новини)|(підписатись на новини)(підписатися на оновлення)|(слідкуй за нами)|(підписатися на оновлення))',
    r'^(поширити|поділитис[ья])\s*(([ув]\s*соцмережах)|(новиною)|(це)|(цим))$',
    r'використ(ання(м)?|овує(мо)?)[^!?\.]*cookies',
    r'\[email\sprotected\]',
    r'^((related posts)|(share this post[!?\.]?)|(login)|(you must be logged in to post a comment)|(comments)|(comments are closed)|(more in)|(search)|(no media source currently available))$',
    r'підтримай(те)? (нас|про[еє]кт)',
    r'^((долучайтеся до спільноти)|(слідкуйте за новинами)|(раніше на))',
    r'^\s*(підписа|поділи)тис[ья]\s*$',
    r'підпи(суйс|ш(ис|ітьс))[ья][^!?\.]*розсилку',
    r'[ву]сі права захищен(о|і)', 
    r'^((повідомити про помилку)|([cс]ообщить об опечатке))',
    r'©',
    r'^(топ-)?\d*\s*перегляд(и|ів)$',
    r'^політика конфіденційності$',
    r'^\s*(схожі|останні|[ву]сі|популярні|топ)?-?\s*новини\s*(партнерів)?\s*(:)?\s*$',
    r'^((фото)|(відео)|(редактор)\s*:)',
    r"^(\s*(новини)|(за темою)|(теми)|(тема тижня)|(близькі теми)|(матеріали по темі)|(статті на цю ж тему)|(пов[’']язані теми|статті)|(ще на цю тему)|(не пропустіть)|(актуальн[ео])|(це теж цікаво)|(головне сьогодні)|(важливе останнє)|(ще в розділі)|(вам також може сподобатися)|(що читати далі)|(почитати ще)|((схожі|свіжі) (записи|новини|матеріали|публікації))|(зараз читають)\s*)$",
    r"^((?:коментар(і)?)|(?:блог(?:и)?)|соціум|(?:категорі[яї])|обговорення|соціум|головне|докладно|найпопулярніше|гороскоп|популярне|аналітика|реклама|(?:реклама\s*партнерів?)|скопійовано|(?:навігація записів)|рекомендуємо|контакти|(?:ще з сайту)|події|партнери|(?:інші новини)|(?:[гґ]аджети)|важливе|peredplata|(?:особистий кабінет)|архів|(?:вибір редакції)|(?:вам буде цікаво)|(?:(?:ще)?\s*більше новин)|(?:пов[`'’]язаний запис)|(?:ви пропустили)|(?:для вас)|пошук|(?:хмара тегів)|(?:популярні записи)|(?:топ за (?:тиж)? день)|(?:вас зацікавить)|(?:каталог змі)|(?:вибір редакції)|(?:здоров[`'’]я)|(?:культура)|господарка|(?:для чоловіків)|назад|далі|(?:стрічка новин)|інформація|календар|(?:швидкі новини)|(?:медіа гарячих новин)|(?:більше новин)|(?:розбивка на сторінки)|(?:популярне зараз))[:.]?$",
    r'ctrl\s*\+\s*enter',
    r'^((написати|залишити)\s*(відповідь|коментар))|(про|с)?(коментувати)|(копіювати)$',
    r'^((\d{2,4}[-\/]\d{2,4}[-\/]\d{2,4})(,\s*[воу]?)?\s*(\d{2}[-:]\d{2})?)$',
    r"^(понеділок|вівторок|середа|четвер|п'ятниця|субота|неділя)?[,во]?\s*\d*:?\d*,?\s*\d*\s*(((січ|бер(ез)?|кв(іт)?|тр(ав)?|чер(в)?|лип|сер(п)?|вер(ес)?|жов(т)?|гр(уд)?)\.?(ня|ень)?)|(лют(ого|ий)?)|(лис(т)?(опад)?(а)?)|сьогодні|вчора),?\s*\d*\s*[,во]?\s*\d*:?\d*$",
    r'(read?\s*in?\s*english)|(читать?\s*(на русском)|(по-русски))|(читати?\s*українською)',
    r'^((увійти за допомогою)|((ще)?\s*немає облікового запису)|(відновити пароль)|(пароль прийде на пошту)|(блокування реклами ввімкнено)|(перемістити в кошик)|(редагувати)(\?\.))$',
    r'^((підписатись на сповіщення про важливі новини від .+\?) | (дякуємо! тепер редактори знають.)|(ознайомтеся з іншими популярними матеріалами:)|(Хочу отримувати:)|(для згоди, будь ласка, натисніть «прийняти».)|(будь ласка, оберіть мову для подальшої роботи на сайті))$',
]

def remove_junk(article: str):
    return '\n'.join([el for el in article.split('\n') if not any(re.search(regex, el, re.IGNORECASE) for regex in ADS_REGEXEN)])